# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
#Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. 
#Выведите минимальное количество монет, которые нужно перевернуть
# 5 -> 1 0 1 1 0
# 2


# print("Введите количество монет: ")
# n = int(input())
# reshka = 0
# gerb = 0
# for i in range(n):
#     count = int(input("герб(1) или решка(0)? "))
#     if count == 1:
#         gerb +=  1
#     else:
#         reshka += 1
# if reshka > gerb:
#     print(f"переверните монеты с герба на решку {gerb} шт")
# else:
#     print(f"переверните монеты с решки на герб {reshka} шт")



# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. 
#Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки. 
#Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.




# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.


